#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fargate-orchestrator-agent.aws_cloudwatch_log_group.orchestrator_agent will be created
  + resource "aws_cloudwatch_log_group" "orchestrator_agent" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "sysdig-orchestrator-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all          = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
    }

  # module.fargate-orchestrator-agent.aws_ecs_cluster.orchestrator_agent will be created
  + resource "aws_ecs_cluster" "orchestrator_agent" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "sysdig-orchestrator-cluster"
      + tags     = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }

      + setting (known after apply)
    }

  # module.fargate-orchestrator-agent.aws_ecs_service.orchestrator_agent will be created
  + resource "aws_ecs_service" "orchestrator_agent" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "OrchestratorAgent"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all                           = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "OrchestratorAgent"
          + container_port   = 6667
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-041e70e9e798db74d",
              + "subnet-06875d92fdbb7844d",
              + "subnet-0e1cfb8c2a45ff958",
            ]
        }
    }

  # module.fargate-orchestrator-agent.aws_ecs_task_definition.orchestrator_agent will be created
  + resource "aws_ecs_task_definition" "orchestrator_agent" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "sysdig-orchestrator-orchestrator-agent"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all                 = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + track_latest             = false
    }

  # module.fargate-orchestrator-agent.aws_iam_role.orchestrator_agent_execution_role will be created
  + resource "aws_iam_role" "orchestrator_agent_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all              = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.fargate-orchestrator-agent.aws_lb.orchestrator_agent will be created
  + resource "aws_lb" "orchestrator_agent" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = false
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = true
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "network"
      + name                                                         = (known after apply)
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-041e70e9e798db74d",
          + "subnet-06875d92fdbb7844d",
          + "subnet-0e1cfb8c2a45ff958",
        ]
      + tags                                                         = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all                                                     = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.fargate-orchestrator-agent.aws_lb_listener.orchestrator_agent will be created
  + resource "aws_lb_listener" "orchestrator_agent" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 6667
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all          = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.fargate-orchestrator-agent.aws_lb_target_group.orchestrator_agent will be created
  + resource "aws_lb_target_group" "orchestrator_agent" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "60"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 6667
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all                           = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0756043c5e6fb27c5"

      + health_check (known after apply)

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

  # module.fargate-orchestrator-agent.aws_security_group.orchestrator_agent will be created
  + resource "aws_security_group" "orchestrator_agent" {
      + arn                    = (known after apply)
      + description            = "Allow agentino to connect"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
        }
      + tags_all               = {
          + "Application" = "sysdig"
          + "Module"      = "fargate-orchestrator-agent"
          + "description" = "Sysdig Serverless Agent Orchestrator"
          + "iac"         = "terraform"
        }
      + vpc_id                 = "vpc-0756043c5e6fb27c5"
    }

  # module.fargate-orchestrator-agent.aws_security_group_rule.orchestrator_agent_egress_rule will be created
  + resource "aws_security_group_rule" "orchestrator_agent_egress_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.fargate-orchestrator-agent.aws_security_group_rule.orchestrator_agent_ingress_rule will be created
  + resource "aws_security_group_rule" "orchestrator_agent_ingress_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 6667
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6667
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>